const data = {
  page00: {
    title: "光復國小校史導覽",
    subtitle: "Taichung Municipal Kuang-Fu<br>Junior high and Elementary School",
    timeline: {},
    images: []
    },


  page01: {
    title: "舊校區",
    color: "#6BE1E9",
    timeline: {
      "民國57-61年": { 
        text: [
          //{ date: "", word: "" },
          { date: "民國57年", word: "政府為實施九年國民教育，均衡城鄉發展，乃於四月由縣府指派王振賢先生負責於臺中縣霧峰鄉光復新村內籌設本校，七月省府指派陳永英女士為首任校長。學校型態於焉完成，在上級長官指導，各界家長協助支持及全體教職仁和衷共濟下，奠定了本校基礎。民國五十九年八月第三期增建教室八間，班級增為十一班。" },
          { date: "民國60年", word: "十二月奉廳令由光復國民中學與復興國民小學合併，改制為實施九年一貫制實驗學校，探討國民教育九年一貫之可行性，以供全面實施「完全國民教育」之参考。改制後學校面積共六甲有餘，設一至九年級共三十八班有學生一千餘人，尚設有托兒所、幼稚園各一所。" },  
          { date: "民國61年", word: "省派羅新堤先生接掌本校，陸續增建體育活動中心、音樂特別教室、游泳池、國民教育研究中心、傳達室、校史室、電工教室、視聽教室、語言教室及全校播音系統、學校公園化等工程，民國六十二年奉准增設夜間補校。本校負責實驗九年一貫制國民教育之使命，惟因該項實驗有二大困難無法克服：因低年級與高年級各項差距甚大及現行法令無法突破，再奉廳另於六十七學年度第二學期起停止實驗。" },
        ],
        images: [
          //{src:"", caption:""},
          {src:"image/page01/公佈欄.JPG", caption:"公佈欄"},
          {src:"image/page01/文化走廊.jpg", caption:"文化走廊"},
          {src:"image/page01/北棟教室.jpg" , caption:"北棟教室"},
          {src:"image/page01/南棟教室.jpg", caption:"南棟教室"},
          {src:"image/page01/車棚.JPG", caption:"車棚"},
          {src:"image/page01/後門.jpg", caption:"後門"},
          ],
        images2: [
            //{src:"", caption:""},
          {src:"image/page01/活動中心1.JPG", caption:"活動中心1"},
          {src:"image/page01/活動中心2.jpg", caption:"活動中心2"},
          ]
        },
        "民國71-76年": { 
        text: [
          //{ date: "", word: "" },
          { date: "71年07/01", word: "再奉縣令單獨設立光復國民中學及光復國民小學。" },
          { date: "76年02/12", word: "陳文華校長奉派接任校長，落實學生生活教育，為學校學務工作奠定好的基礎。" },
           ],
        images: [
          //{src:"", caption:""},
          {src:"image/page01/活動中心外觀.jpg", caption:"活動中心外觀"},
          {src:"image/page01/穿堂.jpg", caption:"穿堂"},
          {src:"image/page01/音樂教室.JPG", caption:"音樂教室"},
          {src:"image/page01/員生社.jpg", caption:"員生社"},
          {src:"image/page01/家政教室.jpg", caption:"家政教室"},
          {src:"image/page01/專科教室.jpg", caption:"專科教室"},
          ],
        images2: [
          //{src:"", caption:""},
          {src:"image/page01/校長室.jpg", caption:"校長室"},
          {src:"image/page01/國樂教室.JPG", caption:"國樂教室"},
          {src:"image/page01/校長宿舍.jpg", caption:"校長宿舍"},
          {src:"image/page01/國樂器材室.jpg", caption:"國樂器材室"},
          ]
        },
        "民國80-91年": { 
          text: [
            //{ date: "", word: "" },
            { date: "80年03/12", word: "江基樹校長奉派接任校長，落實童軍教育，完成中庭綠美化、文化走廊、操場鋪設PU跑道等工程，並興建文化走廊。" },
            { date: "84年03/18", word: "林堂烈校長奉派接任校長，成立學校棒球隊，並承辦全縣中小學聯合運動會。" },
            { date: "88年02/01", word: "施素琴校長接任，歷經九二一大地震校舍全毀，原址改設地震博物館。同年十月廿三日遷入臨時校地，並得TVBS關懷台灣文教基金會與教育部認養，教育部全力支援重建。" },
            { date: "91年04/11", word: "遷入新建校區，因光復國小遷校有困難，地方人士有不同的聲音，縣府要求本校增設國小部，同年八月一日設置國小部，改名光復國民中小學。" },
          ],
          images: [
            //{src:"", caption:""},
            {src:"image/page01/教學大樓.jpg", caption:"教學大樓"},
            {src:"image/page01/會議室.JPG", caption:"會議室"},
            {src:"image/page01/電腦教室.jpg", caption:"電腦教室"},
            {src:"image/page01/學府藝廊.jpg", caption:"學府藝廊"},
            {src:"image/page01/操場.JPG", caption:"操場"},
            {src:"image/page01/學校大門門口.jpg", caption:"學校大門門口"},
          ],
          images2: [
              //{src:"", caption:""},
            {src:"image/page01/舊校區震後行政大樓走道.jpg", caption:"舊校區震後行政大樓走道"},
            {src:"image/page01/舊校區震後連結走廊.jpg", caption:"舊校區震後連結走廊"},          
          ]
          },
      }
    },


  page02: {
    title: "簡易教室",
    color: "#EC7BBC",
    timeline: {
      "民國88年": { 
        text: [
          //{ date: "", word: "" },
          { date: "", word: "　　本校經九二一大地震摧毀後，原地無法重建，除積極覓地重建新校園外，亦須尋找過渡期的臨時校地。所幸時任教育部楊朝祥部長居中協調，洽借農試所約三甲的耕地，搭建簡易教室讓學生得以順利復課。此外，教育部亦洽榮工處負責興建簡易教室，經連夜趕工，終於以短短23天時間建好49間簡易教室，本校師生使用，結束在帳篷上課的克難日子，並於88/10/23遷入簡易教室上課。" },
          { date: "09/21", word: "本校經九二一大地震摧毀後，原地無法重建，除積極覓地重建新校園外，亦須尋找過渡期的臨時校地。" },
          { date: "09/25", word: "楊朝祥部長協助洽借農試所耕地，搭建簡易教室以便學生復課。" },
          { date: "09/27", word: "農試所同意出借29、30號二塊耕地約三甲地供學校搭建簡易教室復課。" },
          { date: "10/01", word: "簡易教室動土典禮，教育部洽榮工處負責興建。" },
          { date: "10/23", word: "榮工處受命興建簡易教室，特地停止中二高工程進度，調度大型重機具連夜趕工，以短短23天時間建好49間像渡假小屋似的簡易教室，供光復國中結束帳篷上課的克難日子，於今天遷入簡易教室上課。" },
          { date: "10/24", word: "王政北委員載來「馬拉巴栗」親栽，綠化校園。" },
          { date: "10/26", word: "天山部隊支援救災工作告一段落，今天撤退，本鄉各界於10點在社福館辦感恩茶會向部隊致謝。" },
          { date: "10/27", word: "簡易教室啟用典禮，楊朝祥部長親臨主持。" },
            ],
        images: [
          //{src:"", caption:""},
          {src:"image/page02/簡易教室-校長室.jpg", caption:"簡易教室-校長室"},
          {src:"image/page02/簡易教室-校園走道.jpg", caption:"簡易教室-校園走道"},
          {src:"image/page02/簡易教室-風雨操場.jpg", caption:"簡易教室-風雨操場"},
          {src:"image/page02/簡易教室-花圃.jpg", caption:"簡易教室-花圃"},
          ],
        images2: [
            //{src:"", caption:""},
          ]
        },
        "民國88-91年": { 
          text: [
            //{ date: "", word: "" },
            { date: "10/28", word: "游繼岳議員捐贈300棵酒瓶椰子苗、徐文龍代表捐贈300棵桃花心木幼苗等綠化校園。" },
            { date: "11/05", word: "與農試所簽簡易教室所用的農地租約。" },
            { date: "11/09", word: "教育部於來來飯店辦理認養人與被認養學校聯合簽約儀式，學校致贈感謝卡。" },
            { date: "11/16", word: "賴林進借溫會長貨車去田尾載回陳羅二位先生捐的十年生大樹有：桃花心木、水黃皮及1.5公尺高龍柏" },
            { date: "11/29", word: "韓國漢城市三育高中921地震慰問義演。" },
            { date: "12/06", word: "郭英釗建築師與廖俊茂組長洽商捐建風雨操場事宜。" },
            { date: "", word: "　　紅十字會捐贈冷氣供班級教室及辦公室使用。" },
            { date: "", word: "　　江翠國中捐贈圖書一批，讓學生沉浸書海，淡忘地震所帶來的傷害。" },
            { date: "", word: "　　潮州高中、平溪國中、曉明女中、基督教關懷站、法務部、霧峰鄉公所，透過音樂交流、放天燈、義演、關懷輔導等各種方式，為光復學子做心理輔導，掃除師生的震災陰霾。" },
            { date: "", word: "　　國際聯青社、江翠國中、霧峰獅子會、扶輪社、同濟會、台中市女企業家協會、青商會、日本八連股份有限公司等，出錢出力，捐贈經費與設備，改善並充實簡易教室教學內涵。" },
            { date: "91年04/03", word: "學校辦理大型感恩晚會，感謝921震災以來關心本校、支援本校硬體建設、充實設備、綠美化及心靈輔導的32個單位及個人。" },
              ],
          images: [
            //{src:"", caption:""},
            {src:"image/page02/簡易教室-排球場.jpg", caption:"簡易教室-排球場"},
            {src:"image/page02/簡易教室-教室內部.jpg", caption:"簡易教室-教室內部"},
            {src:"image/page02/簡易教室-學生車棚.jpg", caption:"簡易教室-學生車棚"},
            {src:"image/page02/簡易教室-開工典禮.jpg", caption:"簡易教室-開工典禮"},
            ],
          images2: [
            //{src:"", caption:""},
            ]
          },
      }
    },


  page03: {
    title: "重建期",
    color: "#6BE1E9",
    timeline: {
      "民國88年": { 
        text: [
          //{ date: "", word: "" },
          { date: "09/21", word: "午夜一點四十七分發生七點三級大地震，校舍在數十秒內全毀。" },
          { date: "09/23", word: "教育部協調國中小互相支援復課，可以複式教學、合班制或半日課；.霧峰國中林本川校長、光復國小張其政校長均慷慨出借一棟大樓供本校復課。中央與地方民代均倡議光復國中舊址保留作地震災難遺址，永久展示。" },
          { date: "09/24", word: "向李文鴻國代請益校舍遷建適當地點，國代建議台糖地；施校長與溫會長趕赴農會親向李登輝總統報告校舍全毀亟需重建，總統及廖縣長均允諾會通盤考量，全力協助。震災期間國軍對本校支援極盡心，除協助搶救外，並派兵日夜守護、拆各地七六帳作學校復課帳篷、遠赴各地載運課桌椅應學校復課所需、支援搬運車輛及人力…。" },
          { date: "09/25", word: "楊朝祥部長協助洽借農試所耕地，搭建簡易教室以便學生復課。" },
          { date: "09/27", word: "農試所同意出借29、30號二塊耕地約三甲地供學校搭建簡易教室復課。" },
          { date: "10/01", word: "簡易教室動土典禮，教育部洽榮工處負責興建。" },
          { date: "10/04", word: "學校先在活動中心四周、光復國小操場、以及鄉立綜合運動場上搭帳篷復課；工藝教室及車棚改為臨時辦公室，一年級導師在操場體育館下辦公，就近照顧操場上搭棚上課的一年級學生。" },
          { date: "10/06", word: "教育部楊朝祥部長引介台北市TVBS關懷台灣文教基金會李濤董事長認養光復國中校舍重建；當日認養儀式後，壹億肆仟陸佰貳拾玖萬元正式撥入教育部專戶，等待校地覓妥後重建校舍。" },
          ],
        images: [
          //{src:"", caption:""},
          {src:"image/page03/新校區重建過程1.jpg", caption:"新校區重建過程1"},
          {src:"image/page03/新校區重建過程2.jpg", caption:"新校區重建過程2"},
          {src:"image/page03/新校區重建過程3.jpg", caption:"新校區重建過程3"},
          {src:"image/page03/新校區重建過程4.jpg", caption:"新校區重建過程4"},
          {src:"image/page03/新校區重建過程5.jpg", caption:"新校區重建過程5"},
          {src:"image/page03/新校區重建過程6.jpg", caption:"新校區重建過程6"},
          ],
        images2: [
            //{src:"", caption:""},
          ]
        },
        "民國88年-2": { 
          text: [
            //{ date: "", word: "" },
            { date: "10/23", word: "榮工處受命興建簡易教室，特地停止中二高工程進度，調度大型重機具連夜趕工，以短短23天時間建好49間簡易教室，供光復國中結束帳篷上課的克難日子，並於88/10/23遷入簡易教室上課。" },
            { date: "10/27", word: "簡易教室啟用典禮，楊朝祥部長親臨主持。" },
            { date: "11/30", word: "與TVBS蔡憶蕙執行長洽認養合約。" },
            { date: "12/06", word: "郭英釗建築師與廖俊茂組長(工業技術研究院總務單位)洽商捐建風雨操場事宜。" },
            ],
          images: [
            //{src:"", caption:""},
            {src:"image/page03/新校區重建過程7.jpg", caption:"新校區重建過程7"},
            {src:"image/page03/新校區重建過程8.jpg", caption:"新校區重建過程8"},
            {src:"image/page03/新校區重建過程9.jpg", caption:"新校區重建過程9"},
            {src:"image/page03/新校區重建過程10.jpg", caption:"新校區重建過程10"},
            {src:"image/page03/新校區重建過程11.jpg", caption:"新校區重建過程11"},
            {src:"image/page03/新校區重建過程12.jpg", caption:"新校區重建過程12"},
            ],
          images2: [
              //{src:"", caption:""},
            ]
          },
      "民國89-90年": { 
        text: [
          //{ date: "", word: "" },
          { date: "89年01/07", word: "下午兩點在縣府4-2會議室劉世芳副縣長主持校地協調會，溫銘賢會長及楊瑞墩、張七郎、徐文龍、江勝雄、游繼岳、張清江、莊清安、李建國、林加賢等地方人士及家長踴躍出席，台糖首度鬆口，願意有條件釋地。89/3/14於台北中央黨部校地協調，林振宣理事長促成，協調會中台糖再讓步(賠償金付清即釋地)。" },
          { date: "89年05/01-07/17", word: "TVBS委託沈祖海聯合建築師事務所設計規劃、委託大眾測繪公司現況測試、委託唐家俊大地技師事務所所做地質鑽探。" },
          { date: "89年10/25", word: "新校地動土典禮。" },
          { date: "90年01/10", word: "國中部新建工程由長聯得標。" },
          { date: "90年05/09", word: "國小部新建工程由三普得標。" },
        ],
        images: [
          //{src:"", caption:""},
          {src:"image/page03/新校區重建過程13.jpg", caption:"新校區重建過程13"},
          {src:"image/page03/新校區重建過程14.jpg", caption:"新校區重建過程14"},
          {src:"image/page03/新校區重建過程15.jpg", caption:"新校區重建過程15"},
          {src:"image/page03/新校區重建過程16.jpg", caption:"新校區重建過程16"},
          {src:"image/page03/新校區重建過程19.jpg", caption:"新校區重建過程19"},
          {src:"image/page03/新校區重建過程20.jpg", caption:"新校區重建過程20"},
          ],
        images2: [
            //{src:"image/background.jpg", caption:"舊校88-1"},
            {src:"image/page03/新校區重建過程17.jpg", caption:"新校區重建過程17"},
            {src:"image/page03/新校區重建過程18.jpg", caption:"新校區重建過程18"},
          ]
        },
      "民國91年": { 
        text: [
          //{ date: "", word: "" },
          { date: "03/01", word: "林榮森先生義寫碑文及校門校名，留下珍貴書法真蹟。" },
          { date: "03/31", word: "光復國中國中部工程完工。" },
          { date: "04/03", word: "學校辦理大型感恩晚會，感謝921震災以來關心本校、支援本校硬體建設、充實設備、綠美化及心靈輔導的32個單位及個人。" },
          { date: "04/11", word: "學校辦理「歡喜入新厝」活動，國中部正式搬入新校舍上課上班；國小部於6月20日完工，並核准招生，8月1日正式成立。" },
          ],
        images: [
          //{src:"", caption:""},
          {src:"image/page03/910411新校區重建-歡喜入新厝1.jpg", caption:"新校區重建-歡喜入新厝1"},
          {src:"image/page03/910411新校區重建-歡喜入新厝2.jpg", caption:"新校區重建-歡喜入新厝2"},
          {src:"image/page03/910411新校區重建-歡喜入新厝3.jpg", caption:"新校區重建-歡喜入新厝3"},
          {src:"image/page03/910411新校區重建-歡喜入新厝4.jpg", caption:"新校區重建-歡喜入新厝4"},
          {src:"image/page03/910411新校區重建-歡喜入新厝5.jpg", caption:"新校區重建-歡喜入新厝5"},
          {src:"image/page03/校門口紀念碑.jpg", caption:"校門口紀念碑"},  
        ],
        images2: [
          //{src:"", caption:""},
          {src:"image/page03/搬遷到新校區1.jpg", caption:"搬遷到新校區1"},
          {src:"image/page03/搬遷到新校區2.jpg", caption:"搬遷到新校區2"},
          ]
        },
      }
    },
  page04: {
    title: "新校區",
    color: "#EC7BBC",
    timeline: {
      "民國93-99年": { 
        text: [
          //{ date: "", word: "" },
          { date: "", word: "　　本校歷經九二一大地震校舍全毀(原址改設地震教育園區)後，於九十一年四月十一日遷入新建校區，因光復國小遷校有困難，地方人士有不同的聲音，縣府要求本校增設國小部，同年八月一日設置國小部，並改名為光復國民中小學。" },
          { date: "93年08/01", word: "林翠華校長受聘校長職務，改善操場設施，增設教學生態園區、教學步道、烤肉區，強化停車場照明，積極充實圖書教學設備，並於九十四學年度成立一般智能資優班，然於九十七學年度停辦。" },
          { date: "99年12/25", word: "臺中縣市合併升格為院轄市，學校改制為臺中市立光復國民中小學。" },
          ],
        images: [
          //{src:"", caption:""},
          {src:"image/page04/1國中部/另一個角度的塔樓.JPG", caption:"另一個角度的塔樓"},
          {src:"image/page04/1國中部/安心走廊.JPG", caption:"安心走廊"},
          {src:"image/page04/1國中部/車道.JPG", caption:"車道"},
          {src:"image/page04/1國中部/國中部升旗台.JPG", caption:"國中部升旗台"},
          {src:"image/page04/1國中部/國中部集合場.JPG", caption:"國中部集合場"},
          {src:"image/page04/1國中部/視聽中心(1樓)與圖書館(2樓).JPG", caption:"視聽中心與圖書館"},
          ],
        images2: [
            //{src:"", caption:""},
            {src:"image/page04/1國中部/學務處前廣場.JPG", caption:"學務處前廣場"},
            {src:"image/page04/1國中部/學務處後方.JPG", caption:"學務處後方"},
            {src:"image/page04/1國中部/操場.JPG", caption:"操場"},
            {src:"image/page04/1國中部/籃(排)球場.JPG", caption:"籃(排)球場"},
          ]
        },
      "民國100-108年":{
        text: [
          //{ date: "", word: "" },
          { date: "100年8月", word: "黃秀琴女士接任校長職務，訂定「尚德、宏觀、創新」為學校願景，完成圖書館屋頂遮光，重新整建PU跑道，設置行動學習智慧教室，協助運動局取得舊正棒球場用地及棒球場之興建，以解決遷校後棒球隊缺乏棒球練習場之窘境；並於一○六學年度起成立體育班，發展項目為棒球、跆拳道及田徑等項目。" },
          { date: "108年8月", word: "黃秀琴校長退休，遴聘原神圳國中洪瑞濱校長接任本校第九任校長職務，以全人教育成就每一個孩子，打造「6心級」的優質學校為辦學理念，陸續完成普通教室與專科教室全面裝設冷氣、舊正棒球場之興建與啟用、國小部會議室及家長會辦公室翻新工程、視聽教室優化、圖書館冷氣空調工程、風雨操場修繕工程、建置校園公播與直播系統、社區共讀站改造工程及尚德樓老舊廁所改善工程等，致力推動數位教學，班班建置智慧教室，連續多年榮獲教育部數位學習深耕計畫學校；另成功爭取家長會及企業捐贈學校2部公務車，以解決校隊對外比賽交通問題。" },
          { date: "112年", word: "成立校友會，由阮坤池先生擔任創會理事長，林麗雲女士擔任第一屆常務監事。目前正在進行中的重大建設有新建多功能活動中心、新建無障礙電梯、通學步道改善工程、充實家政教室設備等建設，未來亦持續爭取國中部第二棟廁所改善、操場跑道整修等經費補助。" },
          ],
        images: [
          //{src:"", caption:""},
          {src:"image/page04/2國小部/國中小交界花圃.JPG", caption:"國中小交界花圃"},
          {src:"image/page04/2國小部/國小部風雨操場.JPG", caption:"國小部風雨操場"},
          {src:"image/page04/2國小部/國小部遊憩區.JPG", caption:"國小部遊憩區"},
          {src:"image/page04/2國小部/國小部校門.JPG", caption:"國小部校門"},
          {src:"image/page04/2國小部/國小部教室.JPG", caption:"國小部教室"},
          {src:"image/page04/2國小部/國小部廣場.JPG", caption:"國小部廣場"},
          ],
        images2: [
            //{src:"", caption:""},
          ]
      },
      }
    }
  };

  
